Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །ང་ལ་འོད་ཟེར་སྟོབས་ལྡན་རྒྱལ་མཚན་ཡོད།
en: “I have a light called powerful banner

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་དགྲ་རབ་སྤོང་།
en: Those who remember its name will be free from enmity.

source: །ང་ལ་འོད་ཟེར་རབ་ཞི་རྒྱལ་མཚན་ཡོད།
en: I have a light called peaceful banner

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་འདོད་ཆགས་སྤོང་།
en: Those who remember its name will rid themselves of attachment.

source: །ང་ལ་འོད་ཟེར་བསམ་གཏན་རྒྱལ་མཚན་ཡོད།
en: “I have a light called banner of concentration

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་ལོག་སྤྱོད་སྤོང་།
en: Those who remember its name will abandon improper conduct.

source: །ང་ལ་འོད་ཟེར་གྲགས་པའི་རྒྱལ་མཚན་ཡོད།
en: I have a light called illustrious banner

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་གྲགས་པ་འཐོབ།
en: Those who remember its name will become famous.

source: །ང་ལ་འོད་ཟེར་ཡིད་དགའ་རྒྱལ་མཚན་ཡོད།
en: “I have a light called delightful banner

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་མྱ་ངན་མེད།
en: Those who remember its name will not suffer from torments.

source: །ང་ལ་འོད་ཟེར་སྡོམ་གཙང་རྒྱལ་མཚན་ཡོད།
en: I have a light called pure restraint

source: །དེ་ཡི་མིང་འཛིན་ཚུལ་ཁྲིམས་འཆལ་པ་སྤོང་།
en: Those who remember its name will abandon improper discipline.

source: །ང་ལ་འོད་ཟེར་སྤོས་མཆོག་རྒྱལ་མཚན་ཡོད།
en: “I have a light called banner of supreme perfume

source: །དེ་ཡི་མིང་འཛིན་མི་གཙང་མེད་པར་འགྱུར།
en: Those who remember its name will be free from impurity.

source: །ང་ལ་འོད་ཟེར་ཆོས་ཟབ་ཅེས་བྱ་ཡོད།
en: I have a light called profound Dharma

source: །དེ་ཡི་མིང་འཛིན་ཐེ་ཚོམ་མེད་པར་འགྱུར།
en: Those who remember its name will be free from doubts.

source: །ང་ལ་འོད་ཟེར་གནས་པ་མེད་པ་ཡོད།
en: “I have a light called groundless

source: །དེ་ཡི་མིང་འཛིན་སྲེད་པ་སྤོང་བར་འགྱུར།
en: Those who remember its name will abandon existence.

source: །ང་ལ་འོད་ཟེར་རྟོག་བྲལ་ཞེས་བྱ་ཡོད།
en: I have a light called freedom from concepts

source: །དེ་ཡི་མིང་འཛིན་འཛིན་པ་མེད་པར་འགྱུར།
en: Those who remember its name will not hold on to anything.

source: །ང་ལ་འོད་ཟེར་རི་རབ་ཅེས་བྱ་ཡོད།
en: “I have a light called Mount Sumeru

source: །དེ་ཡི་མིང་འཛིན་གཡོ་བ་མེད་པར་འགྱུར།
en: Those who remember its name will be unshakable.

source: །ང་ལ་འོད་ཟེར་གསང་བའི་སྤྱོད་པ་ཡོད།
en: I have a light called secret conduct

source: །དེ་ཡི་མིང་འཛིན་མངོན་པར་ཞེན་པ་མེད།
en: Those who remember its name will be free from clinging.

source: །ང་ལ་འོད་ཟེར་རྣམ་གྲོལ་སྤྱོད་པ་ཡོད།
en: “I have a light called liberated conduct

source: །དེ་ཡི་མིང་འཛིན་འཆིང་བ་མེད་པར་འགྱུར།
en: Those who remember its name will be free from bondage.

source: །ང་ལ་འོད་ཟེར་ལེགས་འདུལ་ཞེས་བྱ་ཡོད།
en: I have a light called excellent control

source: །དེ་ཡི་མིང་འཛིན་མཉེན་དེས་ཐོབ་པར་འགྱུར།
en: Those who remember its name will be pliant and gentle.

source: །ང་ལ་འོད་ཟེར་མི་གཡོ་ཞེས་བྱ་ཡོད།
en: “I have a light called unmoving

source: །དེ་ཡི་མིང་འཛིན་འདོད་ཆགས་ཞེན་སྤོང་འགྱུར།
en: Those who remember its name will abandon attachment and clinging.

source: །ང་ལ་འོད་ཟེར་རབ་འདུལ་ཞེས་བྱ་ཡོད།
en: I have a light called total restraint

source: །དེ་ཡི་མིང་འཛིན་ཚུལ་ཁྲིམས་རྫོགས་པར་འགྱུར།
en: Those who remember its name will observe perfect discipline.

source: །ང་ལ་འོད་ཟེར་དགེ་མང་སྤྱོད་པ་ཡོད།
en: “I have a light called actions of manifold virtues

source: །དེ་ཡི་མིང་འཛིན་གོས་པ་མེད་པར་འགྱུར།
en: Those who remember its name will not be sullied.

source: །ང་ལ་འོད་ཟེར་ཕན་མང་བྱེད་པ་ཡོད།
en: I have a light called numerous benefits

source: །གང་གིས་མིང་ཐོས་ཉེས་པ་རྣམ་སྤོང་འགྱུར།
en: Those who hear its name will rid themselves of negativities.

source: །ང་ལ་འོད་ཟེར་མཆོག་ཤེས་མཐོང་བ་ཡོད།
en: “I have a light called vision of supreme knowledge

source: །གང་གིས་མིང་ཐོས་རྨོངས་པ་མེད་པར་འགྱུར།
en: Those who hear its name will not be deluded.

source: །ང་ལ་འོད་ཟེར་ཕན་ཚོལ་ཞེས་བྱ་ཡོད།
en: I have a light called seeking to benefit

source: །གང་གིས་མིང་ཐོས་ཞེ་སྡང་མེད་པར་འགྱུར།
en: Those who hear its name will be free from anger.

source: །ང་ལ་འོད་ཟེར་སེམས་དགའ་བྱེད་པ་ཡོད།
en: “I have a light called pleasing the mind

source: །གང་གིས་མིང་ཐོས་བདེ་བ་ཐོབ་པར་འགྱུར།
en: Those who hear its name will experience happiness.

source: །ང་ལ་འོད་ཟེར་གདུང་བ་མེད་པ་ཡོད།
en: I have a light called absence of torment

source: །གང་གིས་མིང་འཛིན་སྟོང་ཉིད་རྟོགས་པར་འགྱུར།
en: Those who remember its name will realize emptiness.

source: །ང་ལ་འོད་ཟེར་ངོ་བོ་ཉིད་མེད་ཡོད།
en: “I have a light called absence of essential nature

source: །གང་གིས་མིང་འཛིན་སྤྲོས་ལས་འདའ་བར་འགྱུར།
en: Those who remember its name will transcend concepts.

source: །ང་ལ་འོད་ཟེར་རྟེན་པ་མེད་པ་ཡོད།
en: I have a light called absence of reliance

source: །གང་གིས་མིང་འཛིན་གཡོ་བ་མེད་པར་འགྱུར།
en: Those who remember its name will be unshakable.

source: །ང་ལ་འོད་ཟེར་རྨོངས་དང་བྲལ་བ་ཡོད།
en: “I have a light called freedom from delusion

source: །གང་གིས་མིང་འཛིན་སོམ་ཉི་མེད་པར་འགྱུར།
en: Those who remember its name will be free from hesitation.

source: །ང་ལ་འོད་ཟེར་གནས་མེད་ཅེས་བྱ་ཡོད།
en: I have a light called baseless

source: །གང་གིས་མིང་འཛིན་གཏི་མུག་མུན་པ་སྤོང་།
en: Those who remember its name will rid themselves of the darkness of ignorance.

source: །ང་ལ་འོད་ཟེར་ནང་ལུས་སྐྱོ་བ་ཡོད།
en: “I have a light called weariness of the inner body

source: །གང་གིས་མིང་འཛིན་དེ་ནི་ལེན་མི་འགྱུར།
en: Those who remember its name will not take rebirth.

source: །ང་ལ་འོད་ཟེར་འཛིན་མེད་ཅེས་བྱ་ཡོད།
en: I have a light called absence of grasping

source: །གང་གིས་མིང་འཛིན་ཡི་གེ་ཚིག་འབྲུ་སྤོང་།
en: Those who remember its name will abandon language.

source: །ང་ལ་འོད་ཟེར་རྨོངས་པ་མེད་པ་ཡོད།
en: “I have a light called absence of delusion

source: །གང་གིས་མིང་འཛིན་བརྗོད་དང་བྲལ་བར་འགྱུར།
en: Those who remember its name will be free from verbal expression.

source: །ང་ལ་འོད་ཟེར་འགྲོ་མེད་ཅེས་བྱ་ཡོད།
en: I have a light called absence of going

source: །གང་གིས་མིང་འཛིན་མ་འོངས་ཤེས་པར་འགྱུར།
en: Those who remember its name will foresee the future.

source: །ང་ལ་འོད་ཟེར་ཀུན་མཐའ་ཞེས་བྱ་ཡོད།
en: “I have a light called total limit

source: །གང་གིས་མིང་འཛིན་འདས་པ་ཤེས་པར་འགྱུར།
en: Those who remember its name will know the past.

source: །ང་ལ་འོད་ཟེར་མཚུངས་མེད་ཅེས་བྱ་ཡོད།
en: I have a light called unequaled

source: །གང་གིས་མིང་འཛིན་ཟག་མེད་རྟོགས་པར་འགྱུར།
en: Those who remember its name will realize the absence of defilement.

source: །ང་ལ་འོད་ཟེར་འཕགས་ཐོབ་ཅེས་བྱ་ཡོད།
en: “I have a light called noble attainment

source: །གང་གིས་མིང་འཛིན་མཆོག་གྱུར་ཤེས་པར་འགྱུར།
en: Those who remember its name will know what is supreme.

source: །ང་ལ་འོད་ཟེར་དྲི་མ་མེད་པ་ཡོད།
en: I have a light called stainless

source: །གང་གིས་མིང་འཛིན་མངོན་པར་ཞེན་པ་སྤོང་།
en: Those who remember its name will abandon clinging.

source: །ང་ལ་འོད་ཟེར་རྡུལ་སྤོང་ཞེས་བྱ་ཡོད།
en: “I have a light called abandonment of dust

source: །གང་གིས་མིང་འཛིན་མུན་པ་མེད་པར་འགྱུར།
en: Those who remember its name will be free from darkness.

source: །ང་ལ་འོད་ཟེར་སྲེད་པ་མེད་པ་ཡོད།
en: I have a light called absence of craving

source: །གང་གིས་མིང་འཛིན་རྟེན་དག་སྤོང་བར་འགྱུར།
en: Those who remember its name will give up their reliances.

source: །ང་ལ་འོད་ཟེར་མཆོག་རྒྱལ་ཞེས་བྱ་ཡོད།
en: “I have a light called supreme victory

source: །གང་གིས་མིང་འཛིན་ཕ་རོལ་སྨྲ་བ་ནོན།
en: Those who remember its name will overcome the proponents of opposing views.

source: །ང་ལ་འོད་ཟེར་དར་ལ་བབ་པ་ཡོད།
en: I have a light called youthful

source: །གང་གིས་མིང་འཛིན་སྤྱོད་པ་དྲུག་འགྲུབ་འགྱུར།
en: Those who remember its name will accomplish the six actions.

source: །ང་ལ་འོད་ཟེར་མཆོག་བཙུན་ཞེས་བྱ་ཡོད།
en: “I have a light called supreme nobility

source: །གང་གིས་མིང་འཛིན་ཤེས་པ་ཐོགས་མེད་འགྱུར།
en: Those who remember its name will gain unimpeded insight.

source: །ང་ལ་འོད་ཟེར་མྱུར་བ་ཞེས་བྱ་ཡོད།
en: I have a light called swift

source: །གང་གིས་མིང་འཛིན་དགེ་སློང་མཆོག་འགྲུབ་འགྱུར།
en: Those who remember its name will become the most accomplished monks.

source: །ང་ལ་འོད་ཟེར་མཚན་ལྡན་ཞེས་བྱ་ཡོད།
en: “I have a light called possessing marks

source: །གང་གིས་མིང་འཛིན་ཆོས་ཟབ་རྟོགས་པར་འགྱུར།
en: Those who remember its name will realize the profound Dharma.

source: །ང་ལ་འོད་ཟེར་མཚན་མ་མེད་པ་ཡོད།
en: I have a light called absence of marks

source: །གང་གིས་མིང་འཛིན་ང་རྒྱལ་སྤོང་བར་འགྱུར།
en: Those who remember its name will rid themselves of pride.

source: །ང་ལ་འོད་ཟེར་སྐྱེ་མེད་ཅེས་བྱ་ཡོད།
en: “I have a light called unborn

source: །གང་གིས་མིང་འཛིན་འཐོབ་མེད་རྙེད་པར་འགྱུར།
en: Those who remember its name will reach the absence of attainment.

source: །ང་ལ་འོད་ཟེར་སངས་རྒྱས་དྲན་པ་ཡོད།
en: I have a light called recollecting the Buddha

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས།
en: That is praised by the thus-gone ones.

source: །སངས་རྒྱས་མང་ལ་སྤྱོད་པ་རྣམས་བསྒྲུབས་པས།
en: “By practicing various activities in the presence of many buddhas,

source: །འདི་ལྟ་བུ་ཡི་འོད་ཟེར་གྲུབ་པ་ཡིན།
en: I have attained such a light.

source: །སངས་རྒྱས་སྐུ་ལས་བྱུང་བའི་འོད་ཟེར་རྣམས།
en: The light rays emanating from the bodies of buddhas

source: །རྡུལ་ཕྲན་གྲངས་ནི་བརྒྱ་སྟོང་བྱེ་སྙེད་མངའ།
en: Equal in number all the myriads of particles of dust

source: །དེ་བཞིན་ཞིང་ནི་ཚད་མེད་བྱེ་སྙེད་མངའ།
en: “Present in all the countless millions of buddha realms

source: །དེ་ཡི་གྲངས་ནི་རྒྱ་མཚོའི་བྱེ་མ་སྙེད།
en: As numerous as all the grains of sand present in the ocean.

source: །རྡུལ་དེ་སྙེད་ཀྱི་འོད་ཟེར་རྣམས་ཀྱང་ནི།
en: Each of those light rays, as numerous as all those particles,

source: །སོ་སོ་ལ་ཡང་འཁོར་ནི་མང་པོ་ཡོད།
en: Is surrounded by many attendants. “Those light rays manifest as the pure bodies of the thus-gone ones

source: །འོད་ཟེར་དེས་ནི་སངས་རྒྱས་མེད་ཞིང་དུ། །དེ་བཞིན་གཤེགས་པའི་རྣམ་དག་སྐུར་སྤྲུལ་ནས།
en: In all the realms where there is no buddha,

source: །ཤིན་ཏུ་ཟབ་མོའི་ཆོས་ནི་སྟོན་མཛད་པས།
en: To teach the utterly profound Dharma

source: །སེམས་ཅན་བཟོད་ལ་རབ་ཏུ་འགོད་པར་མཛད།
en: And thereby establish beings in the state of forbearance.

source: །ང་ལ་འོད་ཟེར་སངས་རྒྱས་ཞེས་བྱ་ཡོད།
en: “I have a light called Buddha

source: །སེམས་ཅན་སངས་རྒྱས་ལམ་ལ་གནས་པར་མཛད།
en: That causes beings to abide on the path of the buddhas.

source: །ང་ལ་འོད་ཟེར་ཆོས་ཤེས་བྱ་བ་ཡོད།
en: I have a light called Dharma

source: །ཤིན་ཏུ་རྣམ་དག་གསལ་བྱེད་དྲི་མ་མེད།
en: Whose illumination is immaculate and stainless.

source: །ང་ལ་འོད་ཟེར་དགེ་འདུན་ཞེས་བྱ་ཡོད།
en: “I have a light called Saṅgha

source: །ང་ལ་འོད་ཟེར་རྣམ་དག་ཅེས་བྱ་ཡོད།
en: I have a light called purity

source: །འོད་ཟེར་དེ་ནི་ཁྱད་འཕགས་རྙེད་པར་དཀའ།
en: That is exalted and hard to find.

source: །ང་ལ་འོད་ཟེར་པད་མ་ཞེས་བྱ་ཡོད།
en: “I have a light called lotus

source: །སེམས་ཅན་ཕན་འདོགས་ཡོངས་སུ་སྨིན་པར་བྱེད།
en: That benefits and ripens sentient beings.

source: །ང་ལ་འོད་ཟེར་ཚངས་པ་ཞེས་བྱ་ཡོད།
en: I have a light called Brahmā

source: །ཁ་ཅིག་བརྒྱ་བྱིན་ཡང་ན་ལྷ་ཞེས་བྱ།
en: And others called Śakra —or god—

source: །ཟླ་བ་ཀླུ་དང་གནོད་སྦྱིན་ཞེས་ཀྱང་བྱ།
en: moon , nāga , yakṣa

source: །ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་ཞེས་བྱ།
en: asura , garuḍa

source: །ཁ་ཅིག་རྒྱལ་པོ་བུད་མེད་ཞེས་ཀྱང་བྱ།
en: king , woman

source: །ཁ་ཅིག་བུ་མོ་ཁ་ཅིག་ཁྱེའུ་ཞེས་བྱའོ།
en: girl , and boy

source: །དེ་ལྟར་འོད་ཟེར་སྣ་ཚོགས་མང་པོ་རྣམས།
en: “Through their virtuous qualities, those manifold light rays

source: །སོ་སོར་དགེ་ཆོས་དག་གིས་སྐལ་མཚུངས་འདུལ།
en: Tame each of the beings born with corresponding fortunes,

source: །འཁོར་ནི་ཚད་མེད་བྱེ་བ་སྙེད་དག་ཀྱང་།
en: Ripening all those countless millions of retinues

source: །ཐམས་ཅད་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད།
en: Into awakening.

source: །ང་ལ་འོད་ཟེར་ཤེས་རབ་ཅེས་བྱ་ཡོད།
en: “I have a light called insight

source: །ཁ་ཅིག་ཚུལ་ཁྲིམས་ཁ་ཅིག་མིང་བྱམས་པ།
en: And others called discipline , love

source: །ཁ་ཅིག་སྙིང་རྗེ་དགའ་དང་སྒྲོན་ཞེས་བྱ།
en: compassion , joy , lamp

source: །ཁ་ཅིག་བྱུག་སྤོས་ཁ་ཅིག་རོལ་མོ་སྒྲ།
en: perfumed ointment , and music

source: །འདི་ལྟ་བུ་ལ་སོགས་པའི་འོད་ཟེར་རྣམས།
en: “Those light rays are named

source: །སྔོན་གྱི་སྤྱོད་པའི་རྗེས་སུ་འཐུན་པར་ནི།
en: According to their respective activity And were perfected by attracting

source: །སྐྱེ་དགུའི་རྣམ་པ་ཚད་མེད་ཡོངས་བསྡུས་པས། །དེས་ན་འོད་ཟེར་འདི་དག་རྫོགས་པ་ཡིན།
en: Countless beings.

source: །ང་ལ་འོད་ཟེར་གཙོ་བོ་ཞེས་བྱ་ཡོད།
en: “I have a light called foremost

source: །སངས་རྒྱས་བསྟན་པ་རྣམས་ལ་རྟག་གུས་པས། །དེས་ན་འོད་ཟེར་འདི་ནི་རྫོགས་པ་ཡིན། །སངས་རྒྱས་སྤྱན་གྱིས་སེམས་ཅན་གྲངས་གཟིགས་ནས།
en: By continuously revering the teachings of the Buddha.

source: །སྤུ་ཁུང་ཀུན་ནས་འོད་ཟེར་སྣ་ཚོགས་གཏོང་།
en: “From all his pores, the Buddha emits light rays

source: །འོད་ཟེར་མང་པོ་དེ་དག་རེ་རེ་ཡང་།
en: As numerous as the beings he beholds, And each of those light rays

source: །སོ་སོར་འཁོར་མང་དག་གིས་རབ་ཏུ་བསྐོར།
en: Is surrounded by many attendants.

source: །སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་ཇི་བཞིན་དུ།
en: “As he emits those light rays,

source: །སངས་རྒྱས་འོད་ཟེར་གཏོང་ཞིང་སྨིན་པར་མཛད།
en: The Buddha ripens sentient beings In accordance with Their individual inclinations. “Whoever rejoices and feels inspired

source: །གང་གིས་འོད་ཟེར་བསྟན་པ་འདི་ཐོས་ནས། །རབ་ཏུ་དགའ་ཞིང་མོས་པར་གང་བྱེད་པ།
en: Upon hearing this teaching on those lights

source: །དེ་སྔོན་སངས་རྒྱས་མང་པོ་དག་ལས་ནི། །མདོ་སྡེ་འདི་ནི་ཐོས་པར་གྱུར་པ་ཡིན།
en: Must already have heard this discourse From many buddhas in the past.

source: །ང་ལ་འོད་ཟེར་ཁྱད་པར་འཕགས་པ་ཡོད།
en: “I have a light called exalted

source: །འཁོར་ནི་བྱེ་བ་བརྒྱད་ཅུ་གྲངས་སྙེད་ཡོད།
en: That has eight hundred million attendants;

source: །སྔོན་གྱི་སངས་རྒྱས་དག་ལ་ཚིགས་བཅད་གཅིག །བསྔགས་པས་དེ་ཕྱིར་འོད་ཟེར་འདི་གྲུབ་པོ།
en: I achieved this light by offering One verse of praise to the buddhas in the past.

source: །ང་ལ་འོད་ཟེར་མྱ་ངན་མེད་པ་ཡོད།
en: “I have a light called absence of sorrow

source: །འཁོར་ནི་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་སྙེད་ཡོད་དེ།
en: That has eight hundred billion attendants; I achieved this light by recalling

source: །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་གཅིག་བཟུང་བས། །དེ་ཕྱིར་འོད་ཟེར་འདི་ནི་གྲུབ་པ་ཡིན།
en: A single teaching of a thus-gone one.

source: །ང་ལ་འོད་ཟེར་རྣམ་དག་མཆོག་ཡོད་དེ།
en: “I have a light called utmost purity

source: །འཁོར་ནི་བྱེ་བ་བརྒྱད་ཅུ་གྲངས་སྙེད་ཡོད། །ཏིང་འཛིན་གཅིག་ནི་ཡོངས་སུ་བཟུང་བས་ན།
en: That has eight hundred million attendants;

source: །དེ་ཕྱིར་འོད་ཟེར་འདི་ནི་གྲུབ་པ་ཡིན།
en: I achieved this light By mastering a single absorption.

source: །འདས་པའི་དུས་ཀྱི་སངས་རྒྱས་མཚན།
en: “In the past, a buddha

source: །ཁྱད་པར་འཕགས་པ་ཞེས་བྱ་བྱུང་།
en: Called Exalted

source: །སངས་རྒྱས་དེས་ནི་འཇིག་རྟེན་ན།
en: Appeared in the world.

source: །སྐུ་ཚེའི་ཚད་ནི་མེད་པར་བཞུགས།
en: His lifespan was immeasurable.

source: །དང་པོ་མངོན་པར་སངས་རྒྱས་ཚེ།
en: “When he first reached awakening,

source: །ཆོས་བསྟན་འཁོར་དུ་འདུས་པ་ཡི།
en: The assembly that had gathered around him And to whom he taught the Dharma

source: །གྲངས་ནི་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་སྙེད། །དེ་ཉིད་དུ་ནི་འདུས་པར་གྱུར།
en: Counted eight hundred billion members.

source: །དེ་ཡི་ཚེ་ན་འཛམ་བུ་ཡི། །གླིང་ཆེན་དག་ནི་འདི་དག་ཏུ།
en: “At that time, in the lands of the great Jambudvīpa,

source: །ཡུལ་གྱི་རྒྱལ་པོ་དེ་ཡི་མིང་། །སྒྲ་ལ་མོས་ཞེས་བྱ་བ་བྱུང་།
en: There was a king called Devoted to Words.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་ནི། །བུ་ཕོ་དག་ནི་ལྔ་བརྒྱ་ཡོད།
en: He had five hundred sons who were handsome,

source: །བྱད་བཞིན་དག་ནི་སྡུག་མཛེས་པས། །མཐོང་བ་དག་ནི་དགའ་བར་འགྱུར།
en: Beautiful, and pleasant to behold.

source: །དེ་ཡི་ཚེ་ན་རྒྱལ་པོའི་ཡབ།
en: “Their father, the king,

source: །གཟི་བྱིན་རང་དབང་རབ་ལྡན་ཞིང་།
en: Was a majestic and powerful man Who had sincere faith

source: །དཀོན་མཆོག་དག་ནི་གསུམ་པོ་ལ།
en: In the Three Jewels.

source: །ཤིན་ཏུ་དང་བ་སྐྱེས་པར་གྱུར།
en: “Out of reverence,

source: །རྒྱལ་པོ་དེ་ལ་སྐྱེད་མོས་ཚལ། །མཆོག་ཏུ་གྱུར་པ་ཇི་སྙེད་པ།
en: The king offered to that blessed one

source: །དེ་དག་ཐམས་ཅད་གུས་པས་ནི།
en: All the most magnificent gardens

source: །བཅོམ་ལྡན་དེ་ལ་རབ་ཏུ་ཕུལ།
en: That were in his possession. “All the walkways

source: །སྐྱེད་མོས་ཚལ་ནི་དེ་དག་ཏུ། །འཆག་ས་དག་ནི་ཇི་སྙེད་པ།
en: That crossed those gardens

source: །དེ་དག་ཐམས་ཅད་ཀུན་དུ་ནི།
en: Were lined with

source: །ལྗོན་ཤིང་ཙམ་པ་ཀ་དག་དང་། །ལྗོན་ཤིང་ནྱ་གྲོ་དྷ་དག་དང་། །ལྗོན་ཤིང་ཀིང་ཤུ་ཀ་དང་ནི།
en: Eight hundred million trees: “Magnolia, banyan fig,

source: །ལྗོན་ཤིང་ཨུ་དུམ་བ་ར་དང་། །ལྗོན་ཤིང་པ་ལ་པ་ཏྲ་དང་། །ལྗོན་ཤིང་ཤི་རི་ཤ་དག་དང་། །ལྗོན་ཤིང་མྱ་ངན་ཚལ་ལ་སོགས། །དེ་དག་གྲངས་ནི་སོ་སོར་ཡང་། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་ཡོད།
en: Kiṁśuka, goolar fig, Śiriṣa, aśoka, And other such trees.

source: །ལྗོན་ཤིང་མང་པོ་དེ་དག་ཀྱང་། །དབྱར་དང་དགུན་ནི་འདྲ་བར་ཡང་།
en: “Those many trees blossomed during both summer and winter;

source: །མེ་ཏོག་འབྲས་བུ་ཡལ་ག་དག །ཁ་དོག་དག་ནི་གསལ་ཞིང་རྒྱས།
en: Their branches, fruits, and flowers shone with brilliant colors.

source: །དྲི་མཆོག་དམ་པ་རབ་འབྱུང་ཞིང་།
en: The sweetest fragrances arose from them

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཐུལ། །དགེ་སློང་དག་ནི་ཇི་སྙེད་པ།
en: And perfumed the body of the Thus-Gone One.

source: །ལུས་ཀྱི་ཁ་དོག་གསེར་དང་འདྲ།
en: “All the monks had a golden color.

source: །དེ་དག་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །ལྗོན་ཤིང་དག་ནི་དེ་དྲུང་དུ།
en: They were all sitting in front of those trees. They had all attained retention

source: །འདུག་ནས་རབ་ཏུ་བརྩོན་པས་ན། །གཟུངས་ནི་རབ་ཏུ་ཐོབ་པར་གྱུར།
en: Through great exertion.

source: །དེ་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ།
en: “At that time, out of sympathy

source: །རྒྱལ་པོ་ཡབ་དང་སྲས་རྣམས་དང་། །གཞན་ཡང་འཁོར་ནི་མང་པོ་ལ། །ཤིན་ཏུ་ཐུགས་ནི་བརྩེ་བའི་ཕྱིར།
en: For the king, his sons, and the numerous assemblies, The Thus-Gone One taught them

source: །རྣམ་པར་ངེས་པའི་འོད་ཟེར་མདོ།
en: The sūtra on the definitive lights.

source: །དེ་དག་ལ་ནི་རབ་ཏུ་བསྟན།
en: “When he heard that sūtra,

source: །རྒྱལ་པོ་དེས་ནི་ཐོས་གྱུར་ནས། །སེམས་ནི་རབ་ཏུ་དགའ་བར་གྱུར།
en: The king, overwhelmed with joy, Proclaimed the praises of the Thus-Gone One

source: །ཚིགས་སུ་བཅད་པ་ཚད་མེད་པས།
en: In countless verses.

source: །དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད། །གཞན་ཡང་རྒྱལ་པོ་ཆེན་པོ་དེས།
en: “That great king also offered the Blessed One

source: །རིན་པོ་ཆེ་ཡི་གདུགས་དམ་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་སྙེད། །བཅོམ་ལྡན་དེ་ལ་རབ་ཏུ་ཕུལ།
en: Eight hundred million magnificent bejeweled parasols,

source: །རིན་ཆེན་གདུགས་ནི་རེ་རེ་ལ།
en: Each of them decorated around its edge

source: །ཡིད་བཞིན་ནོར་བུའི་དྲ་བ་དག །མཐའ་མ་འཁོར་བར་རབ་ཏུ་བརྒྱན། །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེ།
en: By garlands of wish-fulfilling gems.

source: །དེ་དག་རེ་རེའི་རིན་ཐང་ཡང་།
en: “Every one of them had the value

source: །འཛམ་བུའི་གསེར་ནི་བཙོ་མ་དག །སྲང་ནི་བྱེ་བ་བརྒྱད་ཅུ་རི།
en: Of eight hundred million coins made of pure gold from the Jambu River.

source: །རིན་ཆེན་གདུགས་ནི་རེ་རེ་ཡང་།
en: Each of those bejeweled parasols was adorned

source: །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་སྙེད། །ཕྲེང་བ་དག་ཏུ་བྱས་པར་གྱུར། །ཡིད་བཞིན་རིན་ཆེན་དེ་དག་ཀྱང་།
en: With tassels made of eight hundred million wish-fulfilling gems.

source: །ཁ་དོག་དག་ནི་རབ་གསལ་བས།
en: “Shining with brilliant colors, Those wish-fulfilling gems emitted light continuously,

source: །ཉིན་མཚན་དག་ནི་མེད་པར་ཡང་། །རྟག་ཏུ་འོད་ཟེར་རབ་ཏུ་གཏོང་།
en: So that there was no distinction Between day and night.

source: །འོད་ཟེར་དེ་དག་རེ་རེས་ཀྱང་།
en: “Each of those light rays

source: །དཔག་ཚད་བརྒྱ་ནི་སྣང་བར་བྱེད།
en: Illuminated a hundred leagues,

source: །འོད་ཟེར་དེ་དག་རབ་གསལ་བས།
en: And their light shone brilliantly,

source: །ཉི་ཟླ་དག་ནི་ཟིལ་གྱིས་གནོན།
en: Eclipsing the sun and the moon.

source: །གཞན་ཡང་རིན་ཆེན་གདུགས་དེ་དག །སེང་གེ་རིན་ཆེན་ཆུན་འཕྱང་ནི།
en: “The four sides of the precious parasols were ornamented

source: །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་དང་། །གསེར་སྐུད་རིན་ཆེན་ཕྲེང་བ་ཡང་།
en: With lions and eight hundred million jewel tassels,

source: །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་དག །ངོས་བཞི་དག་ནི་རབ་ཏུ་བརྒྱན།
en: As well as eight hundred million garlands

source: །གཞན་ཡང་རིན་ཆེན་དམ་པ་ནི།
en: Made of precious golden threads.

source: །འདི་ལྟར་རྣམ་པ་སྣ་ཚོགས་ཀྱིས།
en: “Those sublime bejeweled parasols Were also adorned

source: །མུ་ཏིག་རིན་ཆེན་དྲ་བ་དག །སྤེལ་མ་དག་ཏུ་རྣམ་པར་བརྒྱན།
en: With lattices of precious pearls

source: །འདི་ལྟ་བུ་ཡི་གདུགས་དག་གིས།
en: That intermingled in various ways.

source: །སྐྱེད་མོས་ཚལ་ནི་ཀུན་ཏུ་གཡོགས།
en: “Those parasols completely covered the gardens,

source: །དེ་ཡི་སྟེང་དུ་གཞན་ཡང་ནི།
en: And they were themselves surmounted by countless lotus parasols

source: །པད་མ་སུ་མ་ན་དང་ནི། །པད་མ་ཨ་ཏི་མུག་ཏ་ཀ།
en: Formed by various kinds of flowers

source: །བཏང་བཟུང་ཞེས་ནི་བྱ་བ་དང་། །པད་མ་ཨུ་དུམ་བ་ར་དང་། །པད་མ་སྔོན་པོ་ལ་སོགས་དང་། །དེ་བཞིན་རྣམ་པ་སྣ་ཚོགས་ཀྱི།
en: Such as jasmine, atimuktaka—also known as mucilinda

source: །པད་མའི་གདུགས་ནི་ཚད་མེད་པ།
en: “Udumbara, and blue lotus flowers.

source: །རེ་རེ་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །རིན་ཆེན་དྲ་བ་འཚམ་པར་བྱས།
en: All those parasols were beautified with precious lattices,

source: །གཞན་ཡང་གསེར་གྱི་སྐུད་པ་ལས། །བྱས་པའི་གོས་དག་གིས་ཀྱང་ནི། །བླ་རེ་དག་ཏུ་རབ་བྱས་ནས།
en: And cloths made of golden threads

source: །དེ་ཡི་སྟེང་དུ་ཁྱབ་པར་གཡོགས།
en: That formed a covering canopy above.

source: །གཞན་ཡང་ཙན་དན་རིན་ཆེན་ཁྲི།
en: “Furthermore, eight hundred million bejeweled thrones

source: །གསེར་དག་ལས་ནི་རྐང་བྱས་པ། །དེ་ཡི་གྲངས་ཀྱང་བྱེ་བ་ཕྲག །བརྒྱད་ཅུ་སྙེད་ནི་རབ་ཏུ་བཤམས། །རིན་ཆེན་ཁྲི་ནི་དེ་དག་ལ།
en: Built with sandalwood, supported by legs made of pure gold,

source: །ཟབ་དར་དག་ལས་བྱས་པ་ཡི། །སྟན་ནི་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ། །དེ་ཡི་སྟེང་དུ་རབ་བརྒྱན་ཏོ།
en: And decorated with eight hundred million Cushions made of the finest silk were set forth.

source: །དེ་ཡི་ཚེ་ན་སེམས་ཅན་གྱི། །རྣམ་པ་དག་ནི་ཇི་སྙེད་པ།
en: “At that time, all types of sentient beings—

source: །སྲིད་པའི་རྩེ་མོ་མན་ཆད་ཀྱང་།
en: Up to those residing at the summit of existence—

source: །ཐམས་ཅད་དེར་ནི་འདུས་གྱུར་ནས།
en: Had gathered in that place to hear this discourse

source: །དེ་བཞིན་གཤེགས་པ་དེ་ལས་ནི།
en: From the Thus-Gone One.

source: །མདོ་སྡེ་འདི་ནི་རབ་ཏུ་མཉན།
en: “When they heard this discourse,

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །དྲི་ཟ་ཡི་ནི་རྒྱལ་པོ་དང་། །ལྟོ་འཕྱེ་ཆེན་པོ་ལྷ་མ་ཡིན། །དེ་དག་མདོ་སྡེ་འདི་ཐོས་ནས།
en: Gods, nāgas, yakṣas, the kings of the gandharvas, Mahoragas, and asuras

source: །རབ་ཏུ་དགའ་བའི་སེམས་སྐྱེས་པས།
en: Were overwhelmed with joy. “They proclaimed the praises of the Thus-Gone One

source: །ཚིགས་སུ་བཅད་པ་བརྒྱད་སྟོང་གིས། །དེ་བཞིན་གཤེགས་པའི་བསྔགས་བརྗོད་ནས།
en: In eight thousand verses,

source: །དེ་དག་ཐམས་ཅད་ཀུན་གྱིས་ཀྱང་།
en: And all of them made the aspiration

source: །བྱང་ཆུབ་ཆེན་པོར་སྨོན་ལམ་བཏབ།
en: To reach great awakening.

source: །ལྷ་དང་ཀླུ་དང་ལྷ་མ་ཡིན།
en: “Filled with faith, the gods, the nāgas,

source: །དེ་ལ་སོགས་པ་ཐམས་ཅད་ཀྱང་། །ཡོངས་སུ་དང་བའི་སེམས་ཀྱིས་ནི།
en: The asuras, and all the other beings

source: །མེ་ཏོག་མན་དཱ་ར་བ་དང་། །མུ་ཏིག་རིན་ཆེན་ལ་སོགས་པའི། །ཆར་ཕབ་མཆོད་པ་རབ་ཏུ་བྱས།
en: Showered rains of mandārava flowers And precious pearls as offerings.

source: །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི།
en: “At that time, upon hearing this discourse,

source: །ལྷ་ཆེན་མཐུ་དང་གཟི་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་སྙེད། །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: All the eight hundred million powerful and majestic great gods

source: །རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། །བྱང་ཆུབ་ཆེན་པོར་སྨོན་ལམ་བཏབ།
en: Were also overcome with joy, and made the aspiration to reach great awakening,

source: །མ་འོངས་པ་ཡི་དུས་ཀྱི་ཚེ། །འོད་ཟེར་འདི་འདྲ་ཐོབ་པར་ཤོག །དེ་བཞིན་གཤེགས་པས་དེ་ཡི་ཚེ།
en: ‘In the future, may we also achieve such a light!’ “At that moment, the Thus-Gone One

source: །དེ་ཡི་བསམ་པ་ཐུགས་ཆུད་པས།
en: Knew their thoughts And prophesied their awakening in these words:

source: །མ་འོངས་སངས་རྒྱས་འགྲུབ་འགྱུར་ཞེས། །བྱང་ཆུབ་ཏུ་ནི་ལུང་ཡང་བསྟན།
en: ‘In the future, you will accomplish buddhahood.’

source: །བརྒྱ་བྱིན་ལྷ་ཡི་དབང་པོ་དང་། །ཚངས་པ་འཁོར་དང་བཅས་པ་ཡང་། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་སྙེད། །འོད་ཟེར་རབ་ཏུ་སྟོན་པ་ཡི། །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: Śakra—lord of the gods—Brahmā, and the eight hundred million members of their retinues

source: །རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། །བྱང་ཆུབ་ཏུ་ནི་སེམས་ཀྱང་བསྐྱེད།
en: Also became overwhelmed with joy, gave rise to the mind set on awakening, And received this prophecy:

source: །ཀླུ་ནི་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག །བརྒྱད་ཅུ་སྙེད་ནི་འདུས་པ་དག །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: All the eight hundred million nāgas who had gathered there

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་པས།
en: Also gave rise to the mind set on awakening

source: །ལུང་བསྟན་པ་ཡང་ཐོབ་པར་གྱུར།
en: And received a prophecy.
